{*******************************************************}
{                                                       }
{       常量定义程序库                                  }
{                                                       }
{       Copyright (c) 1998,99 Jetco                     }
{                                                       }
{*******************************************************}
unit unConsts;

interface
 const
  {Declare constants we're interested in}
  NO_PRIVATE = '没有此权限。';
  SFSC_OEP_CODE = '00018178';
  SFSC_INSU_CODE = '745611017';
  eKeyViol = 9729;
  eRequiredFieldMissing = 9732;
  eForeignKey = 9733;
  eDetailsExist = 9734;

  mg_unit_Code='11175905';
  strdateSpit='-';
  strEditMask='9999/99/99;0; ';
  strEditMask1='9999/99/;0; ';
  strEditMask2='9999/99;0; ';



  AssignType:Array[1..3] of integer=(1,2,3);   //1上岗，2续聘，3下岗
  AssignTypeName:Array[1..3] of String=('上岗','续聘','下岗');   


  YearMonthconst='%s年%s月';
  DD_FORMAT='yyyymmdd';
  DD_FORMAT1='yyyy/mm';
  DD_FORMAT2='yyyy/mm/dd';
  DD_FORMAT3='yyyy''年''mm''月''dd''日''';
  DD_FORMAT4='yyyy-MM-dd';
  DD_FORMAT5='MM''/''dd''/''YYYY';
  DD_FORMAT6='yyyy''年''mm''月''';






  BoolYes='是';
  BoolNO='否';
  strCaptionArr:Array[1..8] of String=('上岗处理','下岗处理','续聘处理',
                                       '批续聘处理','修改处理','雇员信息',
                                       '调派审核','批修改处理');
  strCaptionArr1:Array[1..3]of String=('保单增加','保单修改','保单详细');
  strCaptionArr2:Array[1..3]of String=('保险报销增加','保险报销修改','保险报销详细');


  strMgCaptionArr1:Array[1..3]of String=('雇员','商社','外划单位');

 FieldCaption1:Array[0..5] of String=('人才登记号','电脑号','身份证号','姓名','商社代码','商社全称');
 FieldCaption6:Array[0..6] of String=('人才登记号','电脑号','身份证号','姓名','商社代码','商社全称','科别');


 FieldCaption2:Array[0..4] of String=('商社代码','商社简称','商社全称','英文名称','科别');
 FieldCaption3:Array[0..7] of String=('编号','单位简称','单位全称','开户银行',
                                        '帐号','联系人','电话','邮编');

 FieldCaption4:Array[0..4] of String=('人才登记号','电脑号','身份证号','姓名','出生年月');
 FieldCaption5:Array[0..3] of String=('保险公司','保单号','电脑号','类别');
 //档案管理
 fieldcaption7:array[0..2] of string=('用工号','姓名','用工单位');

//公积金
 FieldCaption18:Array[0..7] of String=('姓名','个人帐号','身份证号','性别','出生年月','电脑号','商社代码','商社简称');
 FieldCaption28:Array[0..5] of String=('商社代码','中文全称','中文简称','英文名称','个人帐号','科别');

 FieldCaption31:Array[0..5] of String=('人才登记号','电脑号','身份证号','姓名','出生年月','商社');

 FieldCaption80:Array[0..3] of String=('代码','疾病类别','疾病名称','备注');
 FieldCaption81:Array[0..4] of String=('代码','医院名称','电话','地址','邮编');

 FieldCaption90: array[0..4] of string = ('单位代码', '单位简称', '单位名称', '开户银行', '银行帐号');

 //商社合同
 FieldCaption70: array[0..3] of string = ('合同编号', '签定日期', '经办人', '存放位置');

 //养老金开户单位
 FieldCaption20: array[0..2] of string = ('单位代码', '单位名称', '商社代码');

 MonthsShortName: array[1..12] of string=('Jan','Feb','March','Apr','May','Jun','July','Aug','Sep','Oct','Nov','Dec');

  APPTITLE='外服信息管理系统';
  APPDIR='C:\';

  MSG000='数据被修改，是否保存?';
  Msg001='删除当前记录么？';
  MSG002='该表不可以为空，不能删除！';
  MSG003='无法进行此次操作，请稍后再试';
  MSG004='关闭窗口，当前数据将被存盘，真的关闭么？';
  MSG005='无数据!';
  MSG006='不合法的数据！';
  Msg007='删除以前所有临时数据么？';
  Msg008='不合法的数据!,按ESC取消';
  Msg009='真的取消么？（本次已处理数据会全部丢失）';
  Msg010='不能为空值！';
  Msg011='真的删除么？';
  Msg012='不存在的表或视图%s';
  Msg013='你没有这个权限执行此操作！';
  Msg014='‘%s’不能为空值！';
  Msg015='真的取消么？（当前数据会丢失）';
  MsgDP01_11='不存在‘%s’的‘%S’!';
  Msg016='唯一关键字错误！';
  MSG017='外键错误！';
  MSG018='是否进行月末处理！                      '#13#10#13#10#13#10;
  MSG019='本月已做过月末处理,真的再进行一次么?';
  MSG020='无效的公式！                      '#13#10;
  MSG021='不正确的用户名或密码！';
  MSG022='正在计算,请等候！';
  MSG023='请安装打印机！';
  MSG024='无数据或无数据选择 !';
  MSG025='无法删除,可能当前数据已被使用!';
  MSG026='无法删除已审核的数据!';
  MSG027='请选择记录。';
  MSG028='输入的%s不存在';

  MsgDP01_01='身份证号或商社号或合同起始不能为空!';
  MsgDP01_02='该雇员正被用户处理';
  MsgDP01_03='电脑号为%s的雇员正被其他用户处理';
  MsgDP01_04='该雇员已上岗!';
  MSGDP01_05='当前文字包含英文或数字字符，查询会影响速度，'#13#10'继续查询么？';
  MsgDP01_06='本次已处理的雇员数据会全部丢失，真的取消么?';
  MsgDP01_07='没有权限、或没有雇员被选择、或不该选择多个雇员!';
  MsgDP01_08='真的删除‘%s’的‘%s’么？';
  MsgDP01_09='无法重新处理‘批续聘’!';
  MsgDP01_10='合同终止日期不能为空!';
  MsgDP01_12='请在身份证号里输入雇员信息！';
  MsgDP01_13='余额‘%8.2f’超出范围[‘%8.2f’,‘%8.2f’]'#13#10',真的继续么？';
  MsgDP01_14='人员分类、待遇类别、收费类别,币种不能为空';
  MsgDP01_15='找不到相应的人员分类、待遇类别、收费类别';
  MsgDP01_16='合同终止日期必须大于合同起始日期!';
  MsgDP01_17='合同起始日期不能为空!';
  MsgDP01_18='养老金‘%8.2f’超出范围[‘%8.2f’,‘%8.2f’]'#13#10'封顶保底么？';
  MsgDP01_19='公积金‘%8.2f’超出范围[‘%8.2f’,‘%8.2f’]'#13#10'封顶保底么？';
  MsgDP01_20='时间段不能大于一年';
  MsgDP01_21='请刷新后,再进行这个操作';
  MsgDP01_22='该雇员已被处理,请刷新';
  MsgDP01_23='该条信息不存在，请稍后再试!';
  MsgDP01_24='出现无法删除的错误(可能该条信息已被删除)，请刷新后再尝试!';
  MsgDP01_25='需要刷新么!';
  MsgDP01_26='发生过删除动作，请先刷新!';
  MsgDP01_27='当前人数:%d';
  MsgDP01_28='人才库无此数据或电脑号为空';
  MsgDP01_29='调派库无此数据';
  MsgDP01_30='商社库无此数据';
  FS_ASSIGN_LOCAL='FS_ASSIGN_LOCAL';
  FS_ASSIGN_PRE_LOCAL='FS_ASSIGN_PRE_LOCAL';
  AVIFile='Cool.Avi';
  MsgDP01_31='日期参数不合法！';
  MsgDP01_32='该雇员不是在岗雇员!';
  MsgDP01_33='劳务费不能为零';
  MsgDP01_34='已经进行月末处理,不能删除!';
  MsgDP01_35='当收费类别为部分收费时,实收劳务费必须小于标准劳务费!';
  MSGDP01_36='是否需要清空失业保险，大病保险数据!';
  MSGDP01_37='当收费类别为全额收费、管理费时,实收劳务费必须等于标准劳务费!';
  MSGDP01_38='余额不能小于零!';
  ConTPREP='C:\TPKeBie.db';
  MSGDP01_39='      统计:上岗(%d)  续聘(%d)  下岗(%d)';
  MSGDP01_40=' 可能银行帐号不唯一';
  MSGDP01_41='合同开始日期必须大于合同终止日期！';
  MSGDP01_42='如果要查询更多的信息(模糊查询),请在前面加%,例:%Jetco';
  MSGDP01_43='数据已被处理或删除';

  MIValid  = '080000';  //福利报销全部

  MIValid1 = '080001';  //医药费报销输入
  MIValid2 = '080002';  //医药费报销审核
  MIValid3 = '080003';  //医药费报销查询

  MIValid5 = '080004';  //下岗生活费报销输入
  MIValid6 = '080005';  //下岗生活费报销审核
  MIValid7 = '080006';  //下岗生活费报销查询

  MIValid9 =  '080007';  // 档案费报销输入
  MIValid10 = '080008';  // 档案费报销审核
  MIValid11 = '080009';  // 档案费报销查询

  MIValid13 = '080010'; // 子女托费报销输入
  MIValid14 = '080011'; //子女托费报销审核
  MIValid15 = '080012'; //子女托费报销查询

  MIValid4 = '080013';  //医药费报销汇总
  MIValid8 = '080014';  //下岗生活费报销汇总
  MIValid12 = '080015';  // 档案费报销汇总
  MIValid16 = '080016'; //子女托费报销汇总

  MIValid17 = '080017'; //医药费报表打印
  MIValid18 = '080018'; //档案费报表打印
  MIValid19 = '080019'; //下岗生活费报表打印
  MIValid20 = '080020'; //子女托费报表打印

  MIValid52 = '080021'; //住院审核
  MIValid53 = '080022'; //大病审核
  MIValid64 = '080064'; //住院补贴审核和取消审核  

  MIVALID30 = '080030'; //医药费银行盘
  MIVALID31 = '080031'; //医药费报销核赔
  MIValid32 = '080032';  //医药费报销审核取消
  MIValid33 = '080033';  //子女托费报销审核取消
  MIValid34 = '080034';  //医药费报销特审
  MIValid35 = '080035';  //医保清算查全部
  MIValid36 = '080036';  //医保清算科室
  MIValid37 = '080037';  //住院审核取消

  MIValid38 = '080038';  //有医保卡修改成无医保卡特殊权限
  MIValid39 = '080039';  //有医保参数修改权限
  MIValid42 = '0A0003'; //个人税金管理大盘
  MIValid43 = '0A0004'; //个人税金管理小盘
  MIValid_40 = '080040';  //医保mail发放权限
  MIValid_41 = '080041';  //mail群发查询权限
  MIValid_42 = '080042';  //mail群发操作权限
  MIValid_43 = '080043';  //mail群发科室权限
  MIValid_44 = '080044';  //mail群发业务科权限
  MIValid_45 = '080045'; //暂不理赔mail发放
  MIValid_46 = '080046'; //UPS mail生成发放

  MIValid_51 = '080051';  //医保银行盘置失败
  MIValid_52 = '080052';  //医保银行盘重新发放
  MIValid_61 = '080061';  //医保报销统计
  MIValid_62 = '080062';  //医保工作量统计
  MIValid_63 = '080063';  //医保特殊删除权限，可删除医疗、子女、住院未审核的单据
  MIValid_65 = '080065';  //医保删除单条权限，可删除医疗、子女、住院子未发放的明细记录  

  MIValid_66 = '080066';  //医疗修改特殊权限（可修改全部）
  MIValid_67 = '080067';  //子女修改特殊权限（可修改全部）

  MIValid_79 = '080079';  //医保保险公司数据查询全部科室权限
  MIValid_80 = '080080';  //医保保险公司数据生成权限
  MIvalid_81 = '080081';  //医保保险公司导出意外和家产名单
  MIValid_82 = '080082';  //医保保险公司导出医疗理赔和分摊数据
  MIvalid_83 = '080083';  //医保保险公司数据科室查询权限
  MIValid_84 = '080084';  //医保保险公司数据业务员查询权限

  MIValid21 = '300021'; //监控数据查询
  MIValid22 = '300022'; //监控数据业务部修改
  MIValid23 = '300023'; //监控数据管理部修改

      //合同管理权限
  contract_all='0E2000';//所有合同权限
  contract_dept='0E2001';//合同科室权限
  contract_sales='0E2002';//合同业务员权限
  contract_ARCHIVE='0E2003';//合同归档权限
  contract_comp='0E2004';//合同人事部录公司职工权限
  contract_intercom='0E2005';//合同交互管理员(总部大权限)
  contract_IT='0E2006';//IT运营部数据修改权限，超级权限
  contract_salary='0E2007';//合同工资查看权限
  contract_secob_deptdeal='0E2008';//二次OB不催商社维护权限
  contract_remark='0E2009';//解除备注修改(业务员)'




  MIValid40 = '0A0001'; //职工住房管理查询
  MIValid41 = '0A0002'; //职工住房管理操作

  MIValid51 = '0B0001'; //12种重大疾病处理

  MIValid61 = '002001'; //档案管理查询
  MIValid62 = '002002'; //档案管理处理

  MIValid70 = '0C0000'; //现金发放查询
  MIValid71 = '0C0001'; //医疗补助金审核
  MIValid72 = '0C0002'; //医疗补助金修改
  MIValid73 = '0C0003'; //医疗补助金发放确认

  housemk00 = '0C0020'; //住房基金查询
  housemk01 = '0C0021'; //住房基金开户
  housemk02 = '0C0022'; //住房基金基本信息维护
  housemk03 = '0C0023'; //住房基金收费管理
  housemk04 = '0C0024'; //住房基金销账管理
  housemk05 = '0C0025'; //住房基金银行管理

  OEPreturn00 = '070021';//养老金退现金查询

  OEP_Rtn00 = '600000';//养老金退四金模块进入
  OEP_Rtn01 = '600001';//退四金一次性查询
  OEP_Rtn02 = '600002';//退四金一次性新增修改
  OEP_Rtn03 = '600003';//退四金一次性审核
  OEP_Rtn04 = '600004';//退四金一次性删除
  OEP_Rtn05 = '600005';//退四金退现金查询
  OEP_Rtn06 = '600006';//退四金退现金新增修改
  OEP_Rtn07 = '600007';//退四金退现金审核
  OEP_Rtn08 = '600008';//退四金退现金删除
  OEP_Rtn09 = '600009';//退四金退现金设核销标
  OEP_Rtn10 = '600010';//退四金退现金人工确认
  OEP_Rtn11 = '600011';//退四金银行盘查询
  OEP_Rtn12 = '600012';//退四金银行盘生成
  OEP_Rtn13 = '600013';//退四金银行盘取消


  MIValid81 = '0C0011'; //养老金清算退个人钱处理

  REPValid00= '0E0000'; //报表总部权限
  REPValid01= '0E0001'; //报表科长权限

  MIValid90 = '400000'; //医药管理
  MIValid91 = '400001'; //购药查询
  MIValid92 = '400002'; //购药输入
  MIValid93 = '400003'; //公司职工信息查询
  MIValid94 = '400004'; //公司职工信息输入
  MIValid95 = '400005'; //雇员帐户信息查询
  MIValid96 = '400006'; //雇员帐户信息输入
  MIValid97 = '400007'; //雇员领药信息查询
  MIValid98 = '400008'; //雇员领药信息输入
  MIValid99 = '400009'; //公司职工领药信息查询
  MIValid100 = '400010'; //公司职工领药信息输入
  MIValid101 = '400011'; //外来人员领药信息查询
  MIValid102 = '400012'; //外来人员领药信息输入
  MIValid103 = '400013'; //体检用品领药信息查询
  MIValid104 = '400014'; //体检用品领药信息输入
  MIValid105 = '400015'; //调拨信息查询
  MIValid106 = '400016'; //调拨信息输入
  MIValid107 = '400017'; //调价信息查询
  MIValid108 = '400018'; //调价信息输入
  MIValid109 = '400019'; //损溢信息查询
  MIValid110 = '400020'; //损溢信息输入
  MIValid111 = '400021'; //报警信息查询
  MIValid112 = '400022'; //库存信息查询
  MIValid113 = '400023'; //药品数据字典维护
  MIValid114 = '400024'; //使用限制药品
  MIValid115 = '400025'; //换药查询
  MIValid116 = '400026'; //换药输入
  MIValid117 = '400027'; //不享受体检保健雇员领药
  MIValid118 = '400028'; //雇员年度处理
  MIValid119 = '400029'; //公司职工年度处理
  MIValid120 = '400030'; //数据修改
  MIValid121 = '400031'; //报表
  MIValid122 = '400032'; //体检

  AppMk1 = '090001';//交叉管理特权
  AppMK2 = '090020';//交叉管理操作员

  OUTMK1 = '0D0001';//外划费查询
  OUTMK2 = '0D0002';//外划费合同管理(输入)
  OUTMK12 = '0D0012';//外划费合同管理(业务科修改)
  OUTMK22 = '0D0022';//外划费合同管理(市场部修改)
  OUTMK3 = '0D0003';//外划费参数管理
  OUTMK4 = '0D0004';//外划费变更管理
  OUTMK5 = '0D0005';//外地外企单位管理
  OUTMK6 = '0D0006';//实际外划费营销管理
  OUTMK7 = '0D0007';//实际外划费财务管理
  OUTMK8 = '0D0008';//非外地外企单位管理
  OUTMK9 = '0D0009';//外划工资输入（科）
  OUTMK10 = '0D0010';//外划工资输入（总部）
  OUTMK11 = '0D0011';//外划工资总部审核
  OUTMK13 = '0D0013';//实外划执行外划
  OUTMK31 = '0D0023';//外划一科操作
  OUTMK32 = '0D0024';//外划二科操作
  OUTMK33 = '0D0025';//外划三科操作
  OUTMK34 = '0D0026';//外划四科操作
  OUTMK35 = '0D0027';//外划六科操作
  OUTMK36 = '0D0028';//外划七科操作
  OUTMK37 = '0D0029';//外划八科操作
  OUTMK38 = '0D0030';//外划十科操作
  OUTMK39 = '0D0031';//外划松江操作
  OUTMK40 = '0D0032';//外划变更通知业务部录入
  OUTMK41 = '0D0033';//外划变更通知互代录入
  OUTMK42 = '0D0034';//外划一次性收付正数
  OUTMK43 = '0D0035';//外划人力资源操作

  MSGMI01 = '请确认是否要删除该福利报销单  ？                ' +
    #13#10#13#10 + '   报销编号：%s' +
    #13#10 + '   电脑号：  %s' +
    #13#10 + '   姓名：    %s' +
    #13#10 + '   开药金额：%s' +
    #13#10 + '   报销金额：%s'#13#10;

  MSGMI04 = '请确认是否要删除该福利报销单  ？                ' +
    #13#10#13#10 + '   报销编号：%s' +
    #13#10 + '   电脑号：  %s' +
    #13#10 + '   姓名：    %s' +
    #13#10 + '   领取金额：%s'#13#10;


  MSGMI02=' 该人不存在或无法享受全报医疗保险!不能报销';

  MSGMi03=     '请确认是否要删除条数据？                '
         + #13#10#13#10+'   报销编号：%s'
         + #13#10+      '   电脑号：  %s'
         + #13#10+      '   姓名：    %s'
         + #13#10+      '   报销金额：%s'#13#10;

  MsgMH01_00='请在电脑号里输入雇员姓名！';
  MsgMH01_01='该保单已输入或该保单编号已被使用！';
  MsgMH01_02='请在电脑号里输入雇员信息！';
  MsgMH01_03='有多张相同的保单号，请选择保险公司';
  MSGMh01_04=     '请确认是否要删除该保单  ？                '+
      #13#10#13#10+'   保险公司：%s'+
      #13#10+      '   保单编号：%s'+
      #13#10+      '   投保人：  %s'+
      #13#10+      '   电脑号：  %s'+
      #13#10+      '   姓名：    %s'#13#10;
  MSGMh01_05=     '请确认是否要删除该保险报销单  ？                '+
      #13#10#13#10+'   报销编号：%s'+
      #13#10+      '   电脑号：  %s'+
      #13#10+      '   姓名：    %s'+
      #13#10+      '   报销金额：%s'#13#10;
  MSGMh01_06='请输入“发生日期”范围';
  MSGMh01_07='已经审核，不能修改或删除！';
  MSGMh01_08= '请在商社里输入信息！ ';
  MSGMh01_09= '无调派记录或不享受此待遇';
  MSGMh01_10= '必须进行一次月末处理';
  MsgMH01_11='保险已超额!';
  MsgMH01_12='该雇员正被%s使用!';
  MSGMh01_13='请把报销金额或理赔金额清零后再删除!';


  AppID1='050001'; //业务员
  AppID2='050002'; //科长
  AppID3='050003';//审核
  AppID0='050004';//设置
  AppID00='050005';//调派删除
  AppID01='050006';//动态查询
  AppID02 = '050011';//一次性收付



  AppIDMG01='070001'; //
  AppIDMG02='070002';// 总部养老
  AppIDMG03 = '070003';//养老金查询
  AppIDMG10 = '070010';//养老金年度变更
  oep_chg_feedback_confirm = '072001';//社保变更反馈业务员确认
  oep_chg_feedback_import = '072002';//社保变更反馈业务员导入

  AppID6='040001' ;///医疗保险办理员

  // qinlifang add : 2001/01/18
  //zhangtong modi : 2001/8/1
  accfund_changedept_dep = '060000'; //公积金处理本科(独立）
  accfund_changedept = '060001'; //公积金处理本科(非独立）
  accfund_changeall_dep = '060002'; // 公积金处理全部（独立）
  accfund_changeall = '060003'; // 公积金处理全部(非独立）
  accfund_check_indep = '060004';  //公积金审核非独立
  accfund_check_dep = '060005';  //公积金审核独立
//  accfund_Proc = '060006';  //公积金更新
  accfund_proc_dep = '060006'; //公积金月末处理非独立
  accfund_proc_indep = '060007'; //公积金月末处理独立
  accfund_retrieve = '060008'; //公积金查询
  accfund_pay_feedback = '060009'; //公积金返回在缴帐管理
  accfund_pay_md = '060010';//公积金汇缴书修改独立
  accfund_pay_mdin = '060011';//公积金汇缴书非独立
  accfund_chg_feedback_confirm = '061001';//公积金变更反馈业务员确认
  accfund_change_check = '061002';//公积金缴前比对
  accfund_draw_qry = '060061';//公积金支取总部查询
  accfund_draw = '060062';//公积金支取新增、修改、删除
  accfund_chg_feedback = '061003'; //公积金返回变更帐管理
  accfund_sales_qry = '061004'; //公积金应办、变更、在缴所有业务部查询权限
  MSGGP01_01='没有选择雇员!';
  MSGGP01_02='可能为空或不合法的''起始年月''!';
  MSGGP01_03=     '请确认是否要删除  ？                '
     +#13#10#13#10'   序号：%s'
           +#13#10'   商社：%s'
           +#13#10'   姓名：%s'#13#10;

  MSGGP01_04='养老金变更库有错误记录!';
  MSGGP01_05='真的进行养老金数据更新么？';
  MSGGP01_06='待遇类别、货币类别不能为空';
  MSGGP01_07='找不到相应的年度，待遇类别';
  MSGGP01_08='开始年月不能为空！';
  MSGGP01_09='缴费基数系数不能为空或零!';
  MSGGP01_10='变更类别不能为空!';
  MSGGP01_11='调派类型不能为续聘!';
  MSGGP01_12='无法操作在职帐!';
  MSGGPOAP_STATE:Array[0..1]of string=('新建','转入');
  MSGGPISTABLE:Array[0..1]of string=('未领','已领');
  MSGGPPROC_STAT:Array[0..3]of String=('未付','可付','已审','已付');
  MSGGP01_13='序号被重置!';




  MSGSysParam_01='公式';


 Table_Dict='FIELD_DICT';
  TABLESQL='TABLE_SQL';

  MSGQuery_001='至少选择一个显示字段';
  MSGQuery_002='不正确的字段格式';
  MSGQuery_003='表可能不存在该字段';
  MSGQuery_004='表名不正确！';
  MSGQuery_005='文件不正确';
  MSGQuery_006='文件名与当前查询不匹配';

  //广州项目移植
  //将根据帐号设为全局变量，赋值广州帐号
  //修改by ojx 2004/04/05
//  AccFundB_Comp_Account='455422461443';//广州基本公积金
//  AccFundA_Comp_Account='XXXXXXXX';//广州补充公积金
//  AccFundB_Comp_Account='055753-881222194';//上海基本公积金
//  AccFundA_Comp_Account='055753-881222195';//上海基本公积金
//    AccFundB_Comp_Account='455400461443';  //广州基本公积金大盘
//    AccFundb_Comp_Account_indep= '455402198971';       //广州基本公积金小盘
    AccFundA_Comp_Account='';   //广州补充公积金大盘

  //税金专用中国国别
  china_code = '156';

  //外划工资业务单据类型
  s_outer_salary_type = '5';

  //公积金报表文件夹路径
  accfundreportroute='D:\sfsc\公积金报表\';
  
   //薪酬应用
   adjust_tax         = '100003';   //调整税金
   payroll_manage     = '500001';   //薪酬管理
   payroll_setting    = '500002';   //薪酬管理参数设置
   input_payroll      = '500006';   //薪酬录入
   input_foreign      = '500008';   //录入外币工资
   query_payroll_head = '500009';   //总部薪酬查询
   check_payroll      = '500011';   //薪酬审核
   input_payroll_head = '500012';   //总部薪酬输入
   input_payroll_dept = '500013';   //业务部薪酬输入
   set_item_head      = '500018';   //总部工资项目设置
   input_bonus_head   = '500019';   //总部年终奖录入
   get_report_month   = '500020';   //同月发工资报表查询
   bonus_control_rep  = '500022';   //年终奖录入控制报表
   EpayRcvDiff        = '500023';   //Epay账单个人四金差异
   payroll_group_head = '500024';   //总部薪酬组维护
   set_formula        = '500026';   //计算公式维护
   get_formula_result = '500027';   //根据公式计算工资项目
   del_payroll_head   = '500028';   //总部薪酬修改删除
   tax_item_report    = '500029';   //计税调整项报表

   //薪酬参数配置
   EPAY_DB_KIND      = 0;
   EPAY_ONLINE_YM    = 1;
   EPAY_ARCH_YM      = 2;
   EPAY_READTAX_KIND = 3;
   EPAY_KEEP1        = 4;
   EPAY_CITY_NO      = 5;
   EPAY_TAX_ITEM     = 6;
   EPAY_HEALTH_INSU  = 7;

implementation
end.
